Aggregation and Groupby using Pandas( Used while performing exploratory data analysis)

In [1]:
import pandas as pd
import numpy as np

In [2]:
'''
1. Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object. Go to the editor
Test Data:
   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4
'''
#creating pandas dataframe
student_data= pd.DataFrame({
    'school': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V','V','VI','VI','V','VI'],
    'name': ['Alberto', 'Gino', 'Ryan', 'Eesha', 'Gino', 'David'],
    'date_of_birth': ['15/05/2002', '17/05/2002', '16/05/1999', '15/05/1998', '11/05/2002', '15/05/1997'],
    'age': [12,12,13,13,14,12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33,30,31,32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']
}, index= ['s1','s2','s3','s4','s5','s6'])

#print(student_data)
#group the data in groups on the basis of school code
school_group= student_data.groupby('school')

print(school_group.groups)
print('Type of groupby object created is ' + str(type(school_group)))

{'s001': ['s1', 's4'], 's002': ['s2', 's5'], 's003': ['s3'], 's004': ['s6']}
Type of groupby object created is <class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [3]:
'''
2. Write a Pandas program to split the student_data dataframe by school code and get mean, min, and max value of age for each school.
'''
print(school_group['age'].agg([np.mean,np.min,np.max]))

        mean  amin  amax
school
s001    12.5    12    13
s002    13.0    12    14
s003    13.0    13    13
s004    12.0    12    12

In [4]:
#3. Write a Pandas program to split the student_data dataframe into groups based on school code and class.
class_group= student_data.groupby('class')
print(class_group.groups)

{'V': ['s1', 's2', 's5'], 'VI': ['s3', 's4', 's6']}

In [5]:
#4. Write a Pandas program to split the following given dataframe into groups based on school code and class grouping as a list. 
class_list= student_data.groupby('school')['class'].apply(list)
print(class_list)

school
s001    [V, VI]
s002     [V, V]
s003       [VI]
s004       [VI]
Name: class, dtype: object

In [6]:
#5. Write a Pandas program to split the student_data dataframe into groups based on school code and call a specific group with the name of the group.
print(school_group.get_group('s001'))

   school class     name date_of_birth  age  height  weight  address
s1   s001     V  Alberto    15/05/2002   12     173      35  street1
s4   s001    VI    Eesha    15/05/1998   13     167      30  street1

In [7]:
#6.  Write a Pandas program to split a given dataset, group by one column and remove those groups if all the values of a specific columns are not available.
class_V_group= class_group.get_group('V')
print(class_V_group)

   school class     name date_of_birth  age  height  weight  address
s1   s001     V  Alberto    15/05/2002   12     173      35  street1
s2   s002     V     Gino    17/05/2002   12     192      32  street2
s5   s002     V     Gino    11/05/2002   14     151      31  street2

In [17]:
#7.  Write a Pandas program to split a given dataset, group by two columns and convert other columns of the dataframe into a dictionary with column header as key.
groupby_two= student_data.groupby(['school','class'])
#print(groupby_two.groups)
#print(groupby_two.get_group(('s001', 'V')))

#convert other columns of the dataframe into a dictionary with column header as key
#create a dataframe consisting only 'school', 'class' and 'other_column' column
modify_data= student_data[['school','class']]
#print(modify_data) 

#create a column with name other_columns and it consists of dictionary of remaining column values
other= list()
for row in student_data.iterrows():
  other_values= dict()
  other_values['name']= row[1]['name']
  other_values['date_of_birth']= row[1]['date_of_birth']
  other_values['age']= row[1]['age']
  other_values['height']= row[1]['height']
  other_values['weight']= row[1]['weight']
  other.append(other_values)

#print(other)
modify_data['other_column']= other
print(modify_data)

   school class                                       other_column
s1   s001     V  {'name': 'Alberto', 'date_of_birth': '15/05/20...
s2   s002     V  {'name': 'Gino', 'date_of_birth': '17/05/2002'...
s3   s003    VI  {'name': 'Ryan', 'date_of_birth': '16/05/1999'...
s4   s001    VI  {'name': 'Eesha', 'date_of_birth': '15/05/1998...
s5   s002     V  {'name': 'Gino', 'date_of_birth': '11/05/2002'...
s6   s004    VI  {'name': 'David', 'date_of_birth': '15/05/1997...

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:23: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [9]:
'''8.  Write a Pandas program to split a given dataset using group by on specified column into two labels and ranges. Go to the editor
Split the group on 'salesman_id',
Ranges:
1) (5001...5006)
2) (5007..5012)
Test Data:
    salesman_id  sale_jan
0          5001    150.50
1          5002    270.65
2          5003     65.26
3          5004    110.50
4          5005    948.50
5          5006   2400.60
6          5007   1760.00
7          5008   2983.43
8          5009    480.40
9          5010   1250.45
10         5011     75.29
11         5012   1045.60
'''
sales_data= pd.DataFrame({
    'salesman_id': [5001, 5002, 5003, 5004, 5005, 5006, 5007, 5008, 5009, 5010, 5011, 5012],
    'sale_jan': [150.50, 270.65, 65.26, 110.50, 948.5, 2400.6, 1760, 2983.43, 480.4, 1250.45, 75.29, 1045.6]
})

#print(sales_data)
'''for name,group in sales_data.groupby(sales_data['salesman_id']<5007):
  print(name,group)'''

sales_group2, sales_group1= [x for _, x in sales_data.groupby(sales_data['salesman_id'] < 5007)]
print(sales_group1)
print(sales_group2)

   salesman_id  sale_jan
0         5001    150.50
1         5002    270.65
2         5003     65.26
3         5004    110.50
4         5005    948.50
5         5006   2400.60
    salesman_id  sale_jan
6          5007   1760.00
7          5008   2983.43
8          5009    480.40
9          5010   1250.45
10         5011     75.29
11         5012   1045.60

In [10]:
'''
9. Write a Pandas program to split the following dataset using group by on first column and aggregate over multiple lists on second column. Go to the editor
Test Data:
  student_id         marks
0       S001  [88, 89, 90]
1       S001  [78, 81, 60]
2       S002  [84, 83, 91]
3       S002  [84, 88, 91]
4       S003  [90, 89, 92]
5       S003  [88, 59, 90]
'''
student_marks= pd.DataFrame({
    'student_id': ['S001', 'S001', 'S002', 'S002', 'S003', 'S003'],
    'marks': [[88,89,90],[78,81,60],[84, 83, 91], [84, 88, 91], [90, 89, 92], [88, 59, 90]]
})

#create three columns with name maths, science, english
maths=  list()
science= list()
english= list()

for row in student_marks.iterrows():
  maths.append(row[1]['marks'][0])
  science.append(row[1]['marks'][1])
  english.append(row[1]['marks'][2])

#print(maths,science,english)
#adding columns to the dataframe
student_marks['maths']= maths
student_marks['science']= science
student_marks['english']= english

#dropping a column
#axis= 1 to specify we want to drop column
student_marks= student_marks.drop(['marks'], axis=1)
#print(student_marks)

#grouby student_id
student_id_group= student_marks.groupby('student_id')
print(student_id_group[['maths','science','english']].agg([np.mean,np.min,np.max]))

           maths           science           english
            mean amin amax    mean amin amax    mean amin amax
student_id
S001          83   78   88    85.0   81   89      75   60   90
S002          84   84   84    85.5   83   88      91   91   91
S003          89   88   90    74.0   59   89      91   90   92

In [26]:
'''
10. Write a Pandas program to split a given dataset, group by one column and apply an aggregate function to few columns and another aggregate 
function to the rest of the columns of the dataframe.
'''

df = pd.DataFrame({
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001],
'sale_jan':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 1760, 2983.43, 480.4,  1250.45, 75.29,1045.6],
'sale_feb':[250.5, 170.65, 15.26, 110.5, 598.5, 1400.6, 2760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_mar':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_apr':[150.5, 270.65, 95.26, 210.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_may':[130.5, 270.65, 65.26, 310.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_jun':[150.5, 270.65, 45.26, 110.5, 948.5, 3400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_jul':[950.5, 270.65, 65.26, 210.5, 948.5, 2400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_aug':[150.5, 70.65,  65.26, 110.5, 948.5, 400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_sep':[150.5, 270.65, 65.26, 110.5, 948.5, 200.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_oct':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_nov':[150.5, 270.65, 95.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6], 
'sale_dec':[150.5, 70.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6]
})
#groupby one column
salesman_group= df.groupby('salesman_id')
#print(salesman_group.groups)

group_1= ['sale_jan','sale_feb']
group_2= [x for x in df.columns if x not in group_1]
print(salesman_group[group_1].agg([np.mean,np.max]))
print(salesman_group[group_2].agg([np.mean,np.max]))

             sale_jan              sale_feb
                 mean     amax         mean     amax
salesman_id
5001         1317.865  2400.60  1805.365000  3045.60
5002          783.150  1250.45   366.483333   598.50
5003          295.450   480.40  1295.450000  2480.40
5005          270.650   270.65   170.650000   170.65
5006         2983.430  2983.43  1983.430000  1983.43
5007           75.290    75.29    75.290000    75.29
            salesman_id           sale_mar              sale_apr           \
                   mean  amax         mean     amax         mean     amax
salesman_id
5001               5001  5001  2817.865000  5760.00  1575.365000  3045.60
5002               5002  5002   449.816667   948.50   449.816667   948.50
5003               5003  5003  1295.450000  2480.40  1345.450000  2480.40
5005               5005  5005   270.650000   270.65   270.650000   270.65
5006               5006  5006  1983.430000  1983.43  1983.430000  1983.43
5007               5007  5007    75.290000    75.29    75.290000    75.29

             sale_may              sale_jun              sale_jul           \
                 mean     amax         mean     amax         mean     amax
salesman_id
5001         1567.865  3045.60  3062.865000  5760.00  2817.865000  5760.00
5002          443.150   948.50   449.816667   948.50   716.483333   950.50
5003         1395.450  2480.40  1295.450000  2480.40  1345.450000  2480.40
5005          270.650   270.65   270.650000   270.65   270.650000   270.65
5006         1983.430  1983.43   983.430000   983.43   983.430000   983.43
5007           75.290    75.29    75.290000    75.29    75.290000    75.29

                sale_aug              sale_sep              sale_oct           \
                    mean     amax         mean     amax         mean     amax
salesman_id
5001         2317.865000  5760.00  2267.865000  5760.00  2817.865000  5760.00
5002          449.816667   948.50   449.816667   948.50   449.816667   948.50
5003         1295.450000  2480.40  1295.450000  2480.40  1295.450000  2480.40
5005           70.650000    70.65   270.650000   270.65   270.650000   270.65
5006         1983.430000  1983.43  1983.430000  1983.43  1983.430000  1983.43
5007           75.290000    75.29    75.290000    75.29    75.290000    75.29

                sale_nov              sale_dec
                    mean     amax         mean     amax
salesman_id
5001         2825.365000  5760.00  2817.865000  5760.00
5002          449.816667   948.50   449.816667   948.50
5003         1295.450000  2480.40  1295.450000  2480.40
5005          270.650000   270.65    70.650000    70.65
5006         1983.430000  1983.43  1983.430000  1983.43
5007           75.290000    75.29    75.290000    75.29